noxuz/Secure_CAN-FD_TJA1153_NXP/include/S32K344_PERIPHERAL_DEBUG_FREEZE.h
/*! @name CORE1_DBGFRZ_CTRL_GPR - Core 1 Debug Freeze Control */
/*! @{ */
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_EDMA_MASK (0x1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_EDMA_SHIFT (0U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_EDMA_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_EDMA(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_EDMA_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_EDMA_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FCCU_MASK (0x2U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FCCU_SHIFT (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FCCU_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FCCU(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FCCU_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FCCU_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LCU0_MASK (0x4U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LCU0_SHIFT (2U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LCU0_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LCU0(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LCU0_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LCU0_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LCU1_MASK (0x8U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LCU1_SHIFT (3U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LCU1_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LCU1(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LCU1_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LCU1_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_EMIOS0_MASK (0x10U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_EMIOS0_SHIFT (4U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_EMIOS0_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_EMIOS0(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_EMIOS0_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_EMIOS0_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_EMIOS1_MASK (0x20U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_EMIOS1_SHIFT (5U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_EMIOS1_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_EMIOS1(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_EMIOS1_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_EMIOS1_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_EMIOS2_MASK (0x40U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_EMIOS2_SHIFT (6U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_EMIOS2_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_EMIOS2(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_EMIOS2_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_EMIOS2_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_RTC_MASK (0x80U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_RTC_SHIFT (7U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_RTC_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_RTC(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_RTC_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_RTC_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_SWT0_MASK (0x100U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_SWT0_SHIFT (8U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_SWT0_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_SWT0(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_SWT0_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_SWT0_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_SWT1_MASK (0x200U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_SWT1_SHIFT (9U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_SWT1_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_SWT1(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_SWT1_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_SWT1_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_STM0_MASK (0x400U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_STM0_SHIFT (10U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_STM0_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_STM0(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_STM0_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_STM0_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_STM1_MASK (0x800U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_STM1_SHIFT (11U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_STM1_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_STM1(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_STM1_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_STM1_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_PIT0_MASK (0x1000U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_PIT0_SHIFT (12U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_PIT0_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_PIT0(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_PIT0_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_PIT0_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_PIT1_MASK (0x2000U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_PIT1_SHIFT (13U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_PIT1_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_PIT1(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_PIT1_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_PIT1_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_PIT2_MASK (0x4000U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_PIT2_SHIFT (14U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_PIT2_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_PIT2(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_PIT2_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_PIT2_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI0_MASK (0x8000U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI0_SHIFT (15U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI0_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI0(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI0_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI0_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI1_MASK (0x10000U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI1_SHIFT (16U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI1_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI1(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI1_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI1_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI2_MASK (0x20000U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI2_SHIFT (17U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI2_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI2(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI2_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI2_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI3_MASK (0x40000U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI3_SHIFT (18U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI3_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI3(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI3_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI3_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI4_MASK (0x80000U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI4_SHIFT (19U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI4_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI4(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI4_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI4_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI5_MASK (0x100000U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI5_SHIFT (20U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI5_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI5(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI5_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPSPI5_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPI2C0_MASK (0x200000U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPI2C0_SHIFT (21U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPI2C0_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPI2C0(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPI2C0_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPI2C0_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPI2C1_MASK (0x400000U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPI2C1_SHIFT (22U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPI2C1_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPI2C1(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPI2C1_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_LPI2C1_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXIO_MASK (0x800000U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXIO_SHIFT (23U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXIO_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXIO(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXIO_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXIO_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN0_MASK (0x1000000U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN0_SHIFT (24U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN0_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN0(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN0_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN0_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN1_MASK (0x2000000U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN1_SHIFT (25U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN1_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN1(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN1_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN1_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN2_MASK (0x4000000U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN2_SHIFT (26U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN2_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN2(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN2_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN2_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN3_MASK (0x8000000U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN3_SHIFT (27U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN3_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN3(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN3_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN3_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN4_MASK (0x10000000U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN4_SHIFT (28U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN4_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN4(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN4_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN4_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN5_MASK (0x20000000U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN5_SHIFT (29U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN5_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN5(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN5_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_FLEXCAN5_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_SAI0_MASK (0x40000000U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_SAI0_SHIFT (30U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_SAI0_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_SAI0(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_SAI0_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_SAI0_MASK)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_SAI1_MASK (0x80000000U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_SAI1_SHIFT (31U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_SAI1_WIDTH (1U)
#define Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_SAI1(x) (((uint32_t)(((uint32_t)(x)) << Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_SAI1_SHIFT)) & Peripheral_Debug_Freeze_CORE1_DBGFRZ_CTRL_GPR_SAI1_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group Peripheral_Debug_Freeze_Register_Masks */

/*!
 * @}
 */ /* end of group Peripheral_Debug_Freeze_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K344_Peripheral_Debug_Freeze_H_) */
